config.org
#+TITLE: Config.org
#+AUTHOR: Ian Curran

* Package Setup
#+begin_src emacs-lisp
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
 (package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
   (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

* Basic UI Configuration

** Basic UI Changes
#+begin_src emacs-lisp
(setq inhibit-startup-message t)    ;; Starts on blank screen
(scroll-bar-mode -1)                ;; Disable visible scrollbar
(tool-bar-mode -1)                  ;; Disable tool bar
(menu-bar-mode -1)                  ;; Disable menu bar
(tooltip-mode -1)                   ;; Disable tooltips
(set-fringe-mode 10)                ;; No idea what this does

#+end_src

** Fonts
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist
             '(font . "mono-11"))
#+end_src

** Opacity
#+begin_src emacs-lisp
  (set-frame-parameter (selected-frame) 'alpha '(85 . 50))
   (add-to-list 'default-frame-alist '(alpha . (85 . 50)))

 ;;Uncomment for no transparency
  ;; (set-frame-parameter (selected-frame) 'alpha '(100 . 50))
  ;;  (add-to-list 'default-frame-alist '(alpha . (100 . 50)))
#+end_src

** Line Numbers
#+begin_src emacs-lisp
(column-number-mode)
(global-display-line-numbers-mode t)
(dolist (mode '(org-mode-hook
	        term-mode-hook
	        vterm-mode-hook
		shell-mode-hook
	        eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

* Ivy & Friends

** Ivy
#+begin_src emacs-lisp
(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)	
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))
#+end_src

** Ivy Rich
#+begin_src emacs-lisp
(use-package ivy-rich
  :init
  (ivy-rich-mode 1))
#+end_src

** Councel
#+begin_src emacs-lisp
(use-package counsel
  :bind (("M-x" . counsel-M-x)
         ("C-x b" . counsel-ibuffer)
         ("C-x C-f" . counsel-find-file)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history)))
#+end_src

* Better Help

** Which-Key
#+begin_src emacs-lisp
(use-package which-key
  :ensure t
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 3))
#+end_src

** Helpful
#+begin_src emacs-lisp
(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+end_src

* Doom Modeline
#+begin_src emacs-lisp
;; note that you need to run M-x all-the-icons-install-fonts when first installed
(use-package all-the-icons)
  
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :config (display-battery-mode 1)
  :custom (doom-modline-height 10))
#+end_src

* Themes

** General Themes
#+begin_src emacs-lisp
  (use-package doom-themes)
  (use-package cyberpunk-theme)
  (use-package catppuccin-theme)
  ;; (load-theme 'doom-laserwave t)         ; Awesome Fucking lasers
  ;; (load-theme 'everblush t)
  ;; (load-theme 'ewal-spacemacs-classic t)
#+end_src

** Xresource based

*** Xresources-Theme
#+begin_src emacs-lisp
  (use-package xresources-theme)
  (load-theme 'xresources t)
#+end_src

*** Ewal
#+begin_src emacs-lisp
    (use-package ewal
      :init (setq ewal-use-built-in-always-p nil
                  ewal-use-built-in-on-failure-p t
                  ewal-built-in-palette "sexy-material")
      :if (not window-system)
      :config
      (setq-default mode-line-format nil))

    (use-package ewal-spacemacs-themes
        :if window-system
        :init (progn
                (show-paren-mode +1)
                (global-hl-line-mode)))
#+end_src

* Magit
Emacs, no life,  is worthless without Magit.
#+begin_src emacs-lisp
(use-package magit
  :custom (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

* Better Keybindings

** General
#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup t)
#+end_src

** Defining SPC
#+begin_src emacs-lisp
    (general-create-definer cur/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC"))

  (cur/leader-keys
    "t"   '(:ignore t :which-key "toggles")
    "tt"  '(counsel-load-theme :which-key "choose theme")
    "w"   '(:ignore t :which-key "windows")
    "b"   '(:ignore t :which-key "buffers")
    "bs"  '(kill-some-buffers :which-key "kill multiple buffers")
    "g"   '(magit-status :which-key "magit")
    "f"   '(counsel-find-file :which-key "find or make file")
    "RET" '(vterm :which-key "vterm-other-window"))
#+end_src

** Evil-Mode

*** Evil Hook
#+begin_src emacs-lisp
(defun cur/evil-hook ()
  (dolist (mode '(custom-mode
                  eshell-mode
                  git-rebase-mode
                  erc-mode
                  circe-server-mode
                  circe-chat-mode
                  circe-query-mode
                  sauron-mode
                  term-mode))
   (add-to-list 'evil-emacs-state-modes mode)))
#+end_src

*** Evil Mode
#+begin_src emacs-lisp
  (use-package evil
    :init 
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :hook (evil-mode . cur/evil-hook)
    :config
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join) 
  
    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  ;; Won't enable properly in :config :(
  (evil-mode 1)
#+end_src

*** Evil Collection
#+begin_src emacs-lisp
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))
#+end_src

** Hydra and Key repetition
#+begin_src emacs-lisp
(use-package hydra)

(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))
(cur/leader-keys
  "ts" '(hydra-text-scale/body :which-key "scale-text"))
#+end_src

* Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/proj/code")
      (setq projectile-project-search-path '("~/proj/code" "~/proj/case")))
    (setq projectile-switch-project-action #'projectile-dired))
  (cur/leader-keys
    "p"  '(:ignore t :which-key "projectile")
    "pp" '(projectile-dired :which-key "open project in dired")
    "pf" '(projectile-switch-project :which-key "open project in dired"))

  (use-package counsel-projectile
   :after projectile
   :config
   (counsel-projectile-mode 1))
#+end_src

* Org-Mode

** Org Basics

*** Org-Setup-Hooks
#+begin_src emacs-lisp
(defun efs/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))


(defun efs/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "DejaVu Sans" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :background "#232221" :inherit 'fixed-pitch)
  (set-face-attribute 'org-block-begin-line nil :foreground nil :background "#232221" :inherit 'fixed-pitch)
  (set-face-attribute 'org-block-end-line nil :foreground nil :background "#232221" :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
#+end_src

*** Org
#+begin_src emacs-lisp
(use-package org
  :hook (org-mode . efs/org-mode-setup)
  :config
  (setq org-ellipsis " ▾")

  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  
  (setq org-agenda-files
	'("~/org/tasks.org"
	  "~/org/completed.org"))

  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)

  (efs/org-font-setup))
#+end_src

*** Org-Bullets
#+begin_src emacs-lisp
(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

*** Visual Fill
#+begin_src emacs-lisp

(defun efs/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . efs/org-mode-visual-fill))
#+end_src

*** Org Tempo
#+begin_src emacs-lisp
(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
#+end_src

* Terminal Modes

** Vterm
#+begin_src emacs-lisp
    (use-package vterm
      :commands vterm
      :config
      (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
      ;;(setq vterm-shell "zsh")
      (setq vterm-max-scrollback 10000))
#+end_src

* IDE Stuff

** Basic Settings
#+begin_src emacs-lisp
(setq sh-basic-offset 8)
(setq sh-indentation 8)
(setq-default c-basic-offset 8)
#+end_src

** LSP
#+begin_src emacs-lisp
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
  :config
  (lsp-enable-which-key-integration t))
#+end_src

** Rust
#+begin_src emacs-lisp
(use-package rust-mode)
#+end_src

* Updates
#+begin_src emacs-lisp
(use-package auto-package-update
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "09:00"))
#+end_src

